app/controllers/games_controller.rb

SELECT "games".* FROM "games"
---
  def index
    games = Game.all

SELECT  "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    game = Game.find_by(id: params[:id])