app/controllers/scores_controller.rb

  def index
    scores = Score.all
---
SELECT "scores".* FROM "scores"

  def create
    score = Score.create(params.permit(:player, :game_id, :score))
---
INSERT INTO "scores" ("player", "score", "game_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["player", "none"], ["score", 4], ["game_id", 1], ["created_at", "2019-06-19 20:55:22.260605"], ["updated_at", "2019-06-19 20:55:22.260605"]]